{
  "title": "Как работает DNS и почему нам нужен DNSSEC",
  "tags": "mikhail,bahdashych,mikhail bahdashych,blog,dns,dnssec",
  "type": ["theory"],
  "description": "Вы когда-нибудь слышали о DNS? Бьюсь об заклад, вы слышали! Также держу пари, что если вы пытались понять, что это такое, вы видели DNSSEC. Что ж... пришло время выяснить, насколько глубока эта кроличья нора на самом деле...",
  "pageDescription": "Думаю, все вы, ребята, когда-либо слышали о DNS. Это телефонная книга Интернета, и она преобразует удобочитаемые доменные имена в IP-адреса, анализируемые машинами, и бла-бла-бла. Честно говоря, это буквально кроличья нора, и я решил выяснить, насколько она глубока. Что ж, поверьте мне, вы будете удивлены, и я могу поделиться с вами чертовски интересным материалом. Итак, давайте углубимся в это!",
  "searchTags": "dns,dnssec",
  "intro": "Кроличья нора — думаю, это лучшее описание DNS, которое я нашел. Я был достаточно наивен, чтобы думать, что единственное, что он делает, — это преобразовывает доменные имена в IP-адреса, чтобы гарантировать, что человекочитаемые имена понятны машинам. Я понятия не имею, как неправильно я думал таким образом.",
  "timestamp": "2023-02-20",
  "footer": "Фух... Это было довольно сложно, не так ли? Но теперь вы знаете, что такое DNS и DNSSEC и как они работают. Если после прочтения у вас появилось еще больше вопросов, чем раньше, поздравляю, отныне вы сможете найти все ответы самостоятельно, но пока это все. Большое спасибо за чтение.",
  "toc": {
    "intro": "Введение",
    "Обзор DNS": {
      "terminology": "DNS-терминология",
      "resolutionFlow": "Разрешения DNS адресов",
      "Роли DNS-серверов и полный поиск": {
        "stubResolver": "Преобразователь DNS-заглушек",
        "recursiveResolver": "Рекурсивный преобразователь DNS",
        "rootNameserver": "Корневой DNS-сервер имен",
        "tldNameserver": "TLD DNS-сервер имен",
        "authNameserver": "Авторитетный DNS-сервер имен",
        "rootNameserverVsRootServer": "DNS Root Nameserver vs DNS Root Server"
      },
      "Типы DNS рекордов": {
        "aRec": "A Рекорд (address)",
        "quadA": "AAAA Рекорд (quad A)",
        "mxRec": "MX Рекорд (Mail eXchange)",
        "nsRec": "NS Рекорд (nameserver)",
        "cnameRec": "CNAME Рекорд (Canonical Name)",
        "anameRec": "ANAME Рекорд",
        "txtRec": "TXT Рекорд"
      }
    },
    "dnsSecIssues": "Проблемы безопасности DNS",
    "Обзор DNSSEC": {
      "terminology": "Терминология DNSSEC",
      "resolutionFlow": "Разрешения DNSSEC адресов"
    },
    "dnssecSignCeremony": "Церемония подписания корневого каталога DNSSEC",
    "О шифровании DNS": {
      "dot": "DNS через TLS",
      "doh": "DNS через HTTPS",
      "difference": "Разница между DoT и DoH"
    },
    "conclusion": "Выводы",
    "references": "Контакты и рекомендации"
  },
  "content": [
    {
      "type": "title",
      "content": "Введение"
    },
    "В сегодняшнюю цифровую эпоху система доменных имен (DNS) играет жизненно важную роль в облегчении онлайн-общения и предоставлении пользователям доступа к веб-сайтам и услугам в Интернете. Однако с ростом числа угроз кибербезопасности и злонамеренных действий растет озабоченность по поводу безопасности DNS и связанных с ней потенциальных рисков.",
    "Именно здесь на сцену выходят расширения безопасности DNS (DNSSEC), предлагающие мощное решение для усиления безопасности DNS и защиты от различных атак, таких как спуфинг DNS, отравление кеша и другие формы киберугроз.",
    "В этом посте мы более подробно рассмотрим, что такое DNS и DNSSEC, как они работают и почему они необходимы для поддержания безопасной и надежной интернет-инфраструктуры. Мы также рассмотрим некоторые примеры использования в реальных условиях и обсудим преимущества и ограничения DNSSEC. Итак, если вы хотите узнать больше о DNS и DNSSEC и о том, как они могут помочь защитить ваше присутствие в Интернете, продолжайте читать!",
    {
      "type": "title",
      "content": "Обзор DNS"
    },
    "Как всегда, начнем с краткого описания того, что такое DNS на самом деле и как его можно описать. Самое популярное определение DNS всегда звучит примерно так:",
    {
      "type": "list-bullet",
      "items": [
        "<b>DNS (Система Доменных Имен)</b> — система, которая переводит удобочитаемые доменные имена в IP-адреса, чтобы машины могли общаться друг с другом, используя эти IP-адреса."
      ]
    },
    "Звучит довольно обычно, не так ли? Я хотел попытаться копнуть немного глубже, чтобы узнать, что происходит после того, как вы введете URL-адрес в свой браузер и нажмете кнопку Enter. Я хотел знать, что происходит за кулисами и как ваш компьютер получает IP-адрес исходного веб-сервера.",
    {
      "type": "subtitle",
      "content": "DNS-терминология"
    },
    "Но прежде чем мы начнем, давайте определимся с терминологией, которую будем использовать на протяжении всего нашего долгого путешествия. Не стесняйтесь обращаться к ней, когда вам это нужно:",
    {
      "type": "list-bullet",
      "items": [
        "<b>DNS-домен/DNS-зона</b> — раздел пространства имен DNS. Например: blog.mikhailbahdashych.me. (точка в конце — не опечатка) — это сервер с именем \"blog\" в  домен/зона \"mikhailbahdashych\", которая находится в домене/зоне \"me\", которая находится в \"корневом (.)\" домене/зоне.",
        "<b>Итеративный DNS-запрос</b> — запрос к DNS-серверу: \"Помогите мне, чем можете, но ни у кого больше не спрашивайте\".",
        "<b>Рекурсивный DNS-запрос</b> — запрос к DNS-серверу: \"Дайте мне то, что мне нужно, и спросите всех, кого хотите\".",
        "<b>DNS-сервер</b> — термин, описывающий всю инфраструктуру DNS-ролей. Ничего страшного, если вы не понимаете этого на данный момент, мы это уточним.",
        "<b>DNS-запрос или запрос</b> — запрос на преобразование доменного имени в IP-адрес"
      ]
    },
    {
      "type": "subtitle",
      "content": "Разрешения DNS адресов"
    },
    "Самое первое, о чем нам нужно знать, это: как ваш браузер отправляет некоторый текст в виде URL-адреса и возвращает IP-адрес запрошенного веб-сайта? На данный момент мы обсуждаем DNS только с точки зрения того, что единственное, что он делает, — это конвертирует URL-адреса в IP-адреса веб-сайтов, но мы расширим его использование чуть позже.",
    "Здесь в игру вступает <b>поток разрешения DNS</b>. На примерах все лучше, допустим, вы хотите запросить <b>cloudflare.com. (точка в конце не опечатка)</b>. Прежде всего позвольте мне представить вам последовательность всех запросов, весь процесс разрешения, а затем мы шаг за шагом обсудим его части:",
    {
      "type": "list-numeric",
      "items": [
        "Клиент отправляет рекурсивный запрос на свой локальный DNS-сервер рекурсивного кэширования для получения IP-адреса веб-страницы <b>\"cloudflare.com\"</b>.",
        "DNS-сервер с рекурсивным кэшированием отправляет итеративный запрос корневому (<b>\".\"</b>) серверу имен IP-адреса веб-страницы <b>\"cloudflare.com\"</b>.",
        "Корневой сервер имен отвечает ссылкой на сервер имен TLD зоны <b>.com</b>.",
        "DNS-сервер с рекурсивным кэшированием отправляет повторяющийся запрос на сервер доменных имен <b>\".com\"</b> для получения IP-адреса веб-страницы <b>\"cloudflare.com\"</b>.",
        "Сервер доменных имен <b>\".com\"</b> отвечает ссылкой на авторитетный сервер имен зоны <b>\"cloudflare\"</b>.",
        "DNS-сервер с рекурсивным кэшированием отправляет итеративный запрос полномочному серверу имен <b>\"cloudflare\"</b> для получения IP-адреса веб-страницы <b>\"cloudflare.com\"</b>.",
        "Авторитетный сервер имен <b>\"cloudflare\"</b> возвращает IP-адрес для <b>\"cloudflare.com\"</b>.",
        "DNS-сервер рекурсивного кэширования отвечает исходному клиенту с IP-адресом <b>\"cloudflare.com\"</b> (и кэширует его, если у него не было этой записи).",
        "Клиент взаимодействует с веб-сервером <b>\"cloudflare.com\"</b>."
      ]
    },
    {
      "type": "picture",
      "width": "w80",
      "resource": "dns_record_request_sequence_recursive_resolver.png"
    },
    "Ладно, умник, а насчет субдоменов, например, <b>\"blog.cloudflare.com\"</b>? Ничего страшного, последовательность будет расширена для еще одного авторитетного сервера имен, который содержит IP-адрес этого субдомена.",
    {
      "type": "picture",
      "width": "w80",
      "resource": "dns_record_request_sequence_cname_subdomain.png"
    },
    "Ну-ну, я вижу, у тебя много вопросов. Хорошо, давайте разберем эту последовательность с пошаговыми объяснениями различных типов серверов имен. Пришло время разобраться во всем, что касается <b>ролей DNS-серверов и полного поиска</b>.",
    {
      "type": "subtitle",
      "content": "Роли DNS-серверов и полный поиск"
    },
    "Первое, что вам нужно понять, это то, что все эти серверы имен, такие как root, TLD и бла-бла-бла, — это просто роли. Буквально это может быть только одна физическая машина (виртуальная или нет), которая отвечает за обработку почти каждого шага описанной выше последовательности. Кроме того, я думаю, вы уже заметили, что существует некоторая <b>иерархия</b> DNS-серверов, и это правда. Все роли DNS — это места в иерархии, которая идет снизу вверх.",
    "Кстати, <b>будем считать, что кэширования на каждом шаге последовательности нет</b>. Вы должны знать, что <b>кеширование</b>, вероятно, является одной из самых важных функций DNS. Мы хотим делать как можно меньше запросов, чтобы сохранить высокую производительность системы. Кэширование присутствует буквально на каждом этапе процесса разрешения DNS.",
    "Кроме того, давайте немного изменим нашу последовательность и позвольте мне представить весь <b>процесс поиска DNS</b>. Просто запомните эту картинку и вернитесь к ней после того, как вы прочитаете о каждой роли, чтобы завершить эту картинку в своей голове и понять каждый шаг и роль для поиска DNS.",
    {
      "type": "picture",
      "width": "w100",
      "resource": "what_is_a_dns_server_dns_lookup.png"
    },
    "Итак, самое первое, с чем сталкивается ваш DNS-запрос, — это <b>преобразователь заглушек DNS</b>.",
    {
      "type": "subsubtitle",
      "content": "Преобразователь DNS-заглушек"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>Резолвер DNS-заглушек</b> — это промежуточный компонент между приложением, требующим разрешения DNS, и рекурсивным распознавателем DNS. Преобразователь заглушек DNS обычно используется устройствами конечных пользователей, такими как ноутбуки, смартфоны и другие сетевые устройства, для поиска доменных имен для веб-сайтов и других онлайн-сервисов."
      ]
    },
    "Преобразователь DNS на уровне операционной системы — это вторая и последняя локальная остановка перед тем, как DNS-запрос покинет вашу машину. Процесс внутри вашей операционной системы, предназначенный для обработки этого запроса, обычно называется <b>\"резольвером-заглушкой\"</b> или <b>DNS-клиентом</b>. Когда резолвер-заглушка получает запрос от приложения, он сначала проверяет свой собственный кэш, чтобы узнать, есть ли у него запись. Если это не так, он отправляет DNS-запрос (с установленным рекурсивным флагом) за пределы локальной сети рекурсивному преобразователю DNS внутри поставщика услуг Интернета (ISP).",
    "Я думаю, вы заметили, что на картинках нет резольвера-заглушки, но это нормально. Это шаг между клиентом и рекурсивным преобразователем DNS. По сути, это шаг, на котором клиент проверяет, есть ли уже кешированный IP-адрес запрошенного доменного имени. Также для лучшего понимания отметим все шаги, где задействована эта роль. Допустим, это <b>шаг 0</b>.",
    {
      "type": "subsubtitle",
      "content": "Рекурсивный преобразователь DNS"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>Рекурсивный преобразователь DNS</b> — рекурсивный преобразователь это компонент, отвечающий за ответы на рекурсивный запрос от клиента и требующий времени для отслеживания записи DNS (обычно 24 часа). Он выполняет задачу разрешения DNS-запросов путем рекурсивного обхода иерархии DNS. Когда рекурсивный преобразователь получает DNS-запрос от клиента, он будет запрашивать другие DNS-серверы от имени клиента, чтобы преобразовать доменное имя в IP-адрес."
      ]
    },
    "<b>DNS Recursive Resolver — это связующее звено всего потока.</b>",
    "Одним из ключевых преимуществ использования рекурсивного преобразователя является то, что он может <b>кэшировать</b> записи DNS для повышения эффективности последующих DNS-запросов. Вот почему мы также будем называть его <b>сервером кэширования DNS</b>. Когда рекурсивный преобразователь получает ответ DNS, он сохраняет ответ в своем кеше в течение определенного периода времени (известного как время жизни или TTL), чтобы он мог быстро отвечать на будущие запросы для того же доменного имени. . Это может помочь снизить нагрузку на систему DNS и повысить производительность поиска DNS.",
    "Здесь все начинается. Клиент (конечный пользователь) отправляет рекурсивный запрос на свой локальный DNS-сервер с рекурсивным кэшированием для <b>cloudflare.com</b>. Это <b>шаг 1</b>.",
    {
      "type": "subsubtitle",
      "content": "Корневой DNS-сервер имен"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>Корневой сервер имен DNS</b> — корневой сервер имен <b>(Корневой сервер имен DNS ≠ Корневой сервер DNS!!! Мы обсудим это позже.)</b> — это первый шаг в преобразовании (разрешении) удобочитаемого имена хостов в IP-адреса. Помните ту точку в доменном имени, это была не опечатка? Здесь в игру вступает корневой сервер имен."
      ]
    },
    "Сервер рекурсивного кэширования отправляет повторяющийся запрос корневому серверу имен <b>\".\"</b> для <b>cloudflare.com</b> — <b>шаг 2</b>. Корневой сервер имен отвечает ссылкой на сервер имен зоны <b>\".com\"</b>. Но что такое <b>\".com\"</b>, конечно, это домен верхнего уровня! Корневой сервер отвечает ссылкой на серверы имен TLD зоны <b>\".com\"</b>.",
    {
      "type": "subsubtitle",
      "content": "TLD DNS-сервер имен"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>DNS TLD Nameserver</b> — TLD означает домен верхнего уровня. Сервер имен TLD хранит информацию обо всех доменных именах, имеющих общее расширение домена, например <b>\".com\"</b, <b>\".net\"</b> или любое другое имя, которое следует за последней точкой в URL-адресе. Например, сервер доменных имен <b>\".com\"</b> содержит информацию о каждом веб-сайте, оканчивающемся на <b>\".com\"</b>."
      ]
    },
    "DNS-сервер рекурсивного кэширования отправляет повторяющийся запрос на сервер <b>\".com\"</b> для cloudflare.com — <b>шаг 4</b>. Сервер имен TLD отвечает ссылкой на авторитетный сервер имен зоны cloudflare — <b>шаг 5</b>.",
    {
      "type": "subsubtitle",
      "content": "Авторитетный DNS-сервер имен"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>Авторитетный сервер имен DNS</b>. Этот окончательный сервер имен можно рассматривать как словарь на полке с книгами, в котором конкретное имя может быть переведено в его определение. Полномочный сервер имен является последней остановкой в запросе сервера имен. Если полномочный сервер имен имеет доступ к запрошенной записи, он вернет IP-адрес для запрошенного имени хоста обратно рекурсору DNS, который сделал первоначальный запрос."
      ]
    },
    "DNS-сервер рекурсивного кэширования отправляет повторяющийся запрос на сервер <b>\"cloudflare\"</b> для <b>\"cloudflare.com\"</b> — <b>шаг 6</b>. Авторитетный сервер имен <b>\"cloudflare.com\"</b> возвращает IP-адрес для <b>\"cloudflare.com\"</b> — <b>шаг 7</b>. DNS-сервер с рекурсивным кэшированием отвечает исходному клиенту IP-адресом <b>\"cloudflare.com\"</b> — <b>шаг 8</b> — и клиент взаимодействует с веб-сервером <b>\"cloudflare.com\"</b> — <b>шаги 9 и 10</b>.",
    "Отлично, вот и все о поиске DNS. Теперь вы знаете, как это работает и какие компоненты задействованы. Вероятно, вы заметили, что существует множество \"DNS-серверов\". Когда я говорю \"DNS-сервер\", я буквально имею в виду всю эту инфраструктуру, потому что DNS-сервер просто объединяет внутри все роли.",
    {
      "type": "subsubtitle",
      "content": "DNS Root Nameserver vs DNS Root Server"
    },
    "Помните рисунок под названием <b>Полный поиск DNS и запрос веб-страницы</b>. На этой картинке есть одна огромная ошибка. Видите ли, шаги 2 и 3 говорят о связи с <b>корневым DNS-сервером</b>, но на самом деле это <b>корневой DNS-сервер имен</b>. Чрезвычайно важно их различать. Итак, позвольте мне объяснить разницу:",
    {
      "type": "list-bullet",
      "items": [
        "<b>Корневые серверы DNS</b> — это 13 полномочных серверов имен, отвечающих за ответы на запросы в корневой зоне системы доменных имен (DNS). Эти серверы эксплуатируются различными организациями по всему миру и обозначаются буквами от A до M. Они являются первым шагом в процессе преобразования доменного имени в IP-адрес и помогают направлять трафик в соответствующий домен верхнего уровня (TLD) сервер имен.",
        "<b>Корневые серверы имен DNS</b> — набор серверов имен, обслуживающих корневую зону DNS. Эти серверы имен отвечают за предоставление ссылок на серверы имен ДВУ и другие авторитетные серверы имен и играют важнейшую роль в функционировании DNS. Термин \"корневой сервер имен\" часто используется взаимозаменяемо с термином \"корневой сервер\", но, строго говоря, первый относится конкретно к серверам имен, которые обслуживают корневую зону."
      ]
    },
    {
      "type": "subtitle",
      "content": "Типы DNS рекордов"
    },
    "В начале нашего пути я сказал, что до какого-то момента мы должны рассматривать DNS как нечто, преобразующее URL-адреса в IP-адреса веб-сайтов. Технически это верно, но только отчасти. DNS отвечает за преобразование <b>каждого удобочитаемого имени ресурса в IP-адрес</b>. Сюда входят не только веб-сайты (IPv4 и IPv6), но и, например, почтовые серверы. Они называются <b>типами записей DNS</b>. Кратко остановимся на наиболее важных из них.",
    {
      "type": "subsubtitle",
      "content": "A Рекорд (address)"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>A Рекорд (address)</b> — показывает IP-адрес для определенного имени хоста или домена. Работает только для типа IPv4. В основном используется для поиска IP-адреса. Используя запись A, веб-браузер может загрузить веб-сайт с использованием доменного имени."
      ]
    },
    {
      "type": "subsubtitle",
      "content": "AAAA Рекорд (quad A)"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>AAAA Рекорд (quad A)</b> — точно так же, как рекорд А указывает на IP-адрес для домена, вместо использования IPv4 используется IPv6. Основное использование if такое же, как и для типа A, но доменное имя преобразуется в более новый адрес протокола IPv6. Мобильные телефоны предпочитают IPv6, если он доступен."
      ]
    },
    {
      "type": "subsubtitle",
      "content": "MX Рекорд (Mail eXchange)"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>MX Рекорд (Mail eXchange)</b> — позволяет направлять электронные письма на почтовый сервер, показывая, куда должны направляться электронные письма для домена. У вас может быть несколько записей MX для одного доменного имени — по сути, просто резервные серверы электронной почты. Чем ниже значение приоритета для сервера, тем он важнее. А в случае, если первичный сервер выйдет из строя, будет использоваться вторичный сервер - схема актив-актив."
      ]
    },
    "Основное его использование — указать, куда должна быть доставлена электронная почта. Должен указывать на имя почтового сервера, а не на IP-адрес. <b>ANAME</b> — может указывать на имя почтового сервера или IP-адрес.",
    {
      "type": "subsubtitle",
      "content": "NS Рекорд (nameserver)"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>NS Рекорд (nameserver)</b> — указывает полномочный DNS-сервер для домена. Другими словами, запись NS помогает указать, где интернет-приложение, такое как веб-браузер, может найти IP-адрес для доменного имени. Обычно для домена указывается несколько серверов имен. Основное использование этих авторитетных серверов заключается в подключении вашего доменного имени к фактическому серверу, на котором размещен ваш сайт. Серверы имен содержат другие записи DNS, такие как записи MX или A."
      ]
    },
    {
      "type": "subsubtitle",
      "content": "CNAME Рекорд (Canonical Name)"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>CNAME Рекорд (Canonical Name)</b> — это запись DNS, которая указывает доменное имя (псевдоним) на другой домен. В записи CNAME псевдоним не указывает на IP-адрес. И доменное имя, на которое указывает псевдоним, является каноническим именем."
      ]
    },
    "Например, поддомен ng.example.com (ng.example.com — запись CNAME) может указывать на example.com с помощью CNAME. Здесь example.com указывает на фактический IP-адрес, используя запись A.",
    "Основное его использование — запуск нескольких поддоменов для разных целей на одном сервере. Например, у нас есть ftp.example.com и www.example.com. Затем мы можем использовать запись CNAME, чтобы указать оба субдомена на example.com. Затем основной домен example.com указывает на IP-адрес сервера с помощью записи A. Также возможно, что один CNAME указывает на другой CNAME. Однако это неэффективно и может привести к снижению скорости загрузки и плохому взаимодействию с пользователем.",
    "Usually points to a load balancer.",
    {
      "type": "subsubtitle",
      "content": "ANAME Рекорд"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>ANAME (ALIAS)</b> — комбинация записей CNAME и A. ANAME — это не DNS-запись, а способ ее имитации. И именно поэтому он называется Псевдоним. Как и CNAME, ANAME сопоставляет одно доменное имя с другим. Итак, ANAME настроено так, чтобы указывать на другой домен. Когда доменное имя, на которое указывает ANAME, запрашивается клиентским браузером, он отвечает IP-адресом. С другой стороны, CNAME не может указывать на IP-адрес, а ANAME может."
      ]
    },
    "Был использован в прошлом, CNAME в настоящее время является королем. Не следует указывать на балансировщик нагрузки.",
    {
      "type": "subsubtitle",
      "content": "TXT Рекорд"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>TXT Рекорд (Text Record)</b> — это тип записи, который позволяет администратору добавлять удобочитаемые (и машиночитаемые) заметки в DNS. Не требует определенного формата. Используется для предоставления возможности связать произвольный текст с хостом или другим именем, например, удобочитаемую информацию о сервере, сети, центре обработки данных или другую учетную информацию."
      ]
    },
    "В настоящее время он используется в основном для предотвращения спама по электронной почте и подтверждения права собственности на домен. Здесь мы должны поговорить о DMARC, SPF и DKIM, а пока просто знайте, что речь идет о <b>защите от спама</b>.",
    {
      "type": "title",
      "content": "Проблемы безопасности DNS"
    },
    "Хорошо, теперь у нас есть полный обзор того, как работает разрешение DNS, каковы разные роли DNS-серверов и даже упомянута пара основных типов записей, но как насчет вопросов безопасности? На самом деле у нас есть только 2 основные проблемы безопасности — <b>отсутствие аутентификации и конфиденциальность</b>.",
    "Первая связана с тем, что DNS не может проверить, поступила ли запрошенная запись из надежного источника, и эта проблема устраняется с помощью <b>DNSSEC</b>.",
    "Во-вторых, это связано с тем, что DNS как протокол был реализован в начале 80-х годов. Как вы уже знаете, в то время безопасность не стояла на первом плане, а все ресурсы были сосредоточены на обеспечении просто доступности. Поэтому DNS, как и многие другие протоколы, такие как HTTP или ART, передает данные в виде открытого текста. Эта проблема устраняется с помощью <b>шифрования</b>.",
    "Хорошо, мы обязательно обсудим оба вопроса, но давайте сначала посмотрим, как выглядит DNS после взлома:",
    {
      "type": "list-numeric",
      "items": [
        "Клиент отправляет рекурсивный запрос на свой локальный DNS-сервер рекурсивного кэширования для получения IP-адреса веб-страницы <b>\"cloudflare.com\"</b>.",
        "DNS-сервер с рекурсивным кэшированием отправляет итеративный запрос корневому (<b>\".\"</b>) серверу имен IP-адреса веб-страницы <b>\"cloudflare.com\"</b>.",
        "Корневой сервер имен отвечает ссылкой на сервер имен TLD зоны <b>\".com\"</b>.",
        "DNS-сервер с рекурсивным кэшированием отправляет повторяющийся запрос на сервер доменных имен <b>\".com\"</b> для получения IP-адреса веб-страницы <b>\"cloudflare.com\"</b>.",
        "Сервер доменных имен <b>.com\"</b> отвечает ссылкой на авторитетный сервер имен зоны <b>\"cloudflare\"</b>.",
        "DNS-сервер с рекурсивным кэшированием отправляет итеративный запрос полномочному серверу имен <b>\"cloudflare\"</b> для получения IP-адреса веб-страницы <b>\"cloudflare.com\"</b>.",
        "Злонамеренный DNS-сервер отвечает вредоносным IP-адресом <b>\"cloudflare.com\"</b>.",
        "DNS-сервер с рекурсивным кэшированием отвечает исходному клиенту вредоносным IP-адресом <b>\"cloudflare.com\"</b>.",
        "Клиент взаимодействует с вредоносным веб-сервером, который либо отвечает напрямую, либо выполняет операцию атаки <b>Человек посередине</b>, пропуская и наблюдая (или изменяя) трафик с/на законный веб-сервер."
      ]
    },
    {
      "type": "picture",
      "width": "w70",
      "resource": "dns_poisoning.jpeg"
    },
    "Как видите, с шага 1 по шаг 6 у нас точно такой же поток, проблемы начинаются с шага 7.",
    "Это называется <b>спуфинг DNS/отравление кэша</b> — это атака, при которой поддельные данные DNS вводятся в кэш преобразователя DNS, в результате чего преобразователь возвращает неверный IP-адрес для домена. Вместо перехода на правильный веб-сайт трафик может быть перенаправлен на вредоносную машину или куда-либо еще по желанию злоумышленника; часто это будет копия исходного сайта, используемая в злонамеренных целях, таких как распространение вредоносных программ или сбор данных для входа.",
    "Итак, нам нужно как-то убедиться, что ответ исходит из надежного источника, верно? По сути, предоставить <b>аутентификацию</b> — здесь в игру вступает <b>DNSSEC</b>.",
    {
      "type": "title",
      "content": "Обзор DNSSEC"
    },
    "Наконец-то мы здесь, DNSSEC! Мы должны учитывать, что DNS и DNSSEC сейчас такие же, как HTTP и HTTPS 20 лет назад. Его просто необходимо будет использовать всем, чтобы обеспечить безопасную связь. DNSSEC и HTTPS в некоторых случаях даже похожи.",
    "HTTPS обеспечивает как <b>аутентификацию</b>, так и <b>конфиденциальность</b>, используя инфраструктуру PKI ЦС (если вы не знакомы - <a href='https://blog.mikhailbahdashych.me/en/blog /pki-infrastructure-or-how-to-build-your-own-vpn' class='inline-link en'>см. здесь</a>). <b>Аутентификация</b> обеспечивается путем проверки того, кто выдал сертификат, а <b>конфиденциальность</b> обеспечивается за счет шифрования трафика.",
    "В случае DNSSEC он обеспечивает только <b>аутентификацию</b>, тогда как шифрование DNS обеспечивает <b>конфиденциальность</b>, о чем уже говорилось выше. Но возвращаясь к DNSSEC, давайте начнем с простого определения того, что это такое на самом деле:",
    {
      "type": "list-bullet",
      "items": [
        "<b>DNSSEC</b> — это механизм аутентификации, использующий криптографию PKI для предотвращения спуфинга. С DNSSEC криптографически подписаны не сами DNS-запросы и ответы, а сами данные DNS, подписанные владельцем данных."
      ]
    },
    "Помните, мы упоминали, что DNS имеет иерархическую структуру? На примере DNSSEC это станет еще более очевидным. Предполагая, что вы уже знакомы с PKI и криптографией, нам нужно ввести несколько новых терминов специально для DNSSEC.",
    {
      "type": "subtitle",
      "content": "Терминология DNSSEC"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>RRSet — набор записей ресурсов</b>. Первым шагом к обеспечению безопасности зоны с помощью DNSSEC является объединение всех записей одного типа в набор записей ресурсов (RRset). Например, если у вас есть три записи AAAA в вашей зоне на одной метке (например, label.example.com), все они будут объединены в один набор AAAA RRset.\n\nНа самом деле это полный набор RRset, который получает цифровую подпись, в отличие от отдельных записей DNS. Конечно, это также означает, что вы должны запрашивать и проверять все записи AAAA из зоны с одной и той же меткой, а не проверять только одну из них. Вкратце — <b>набор записей одного типа и одного домена/зоны</b>."
      ]
    },
    {
      "type": "picture",
      "width": "w80",
      "resource": "diagram-rrsets.svg"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>DNSKEY</b> — содержит открытый ключ подписи.",
        "<b>RRSig — подпись записи ресурса</b> — запись, содержащая цифровую подпись RRSet.",
        "<b>ZSK – ключ подписи зоны</b> – <b>используется для подписи или проверки неключевых записей домена/зоны (A, AAAA, MX и т.д.)</b>. В DNSSEC каждая зона имеет пару ключей подписи зоны (ZSK), где закрытый ключ подписывает каждый набор RRset в зоне, а открытый ключ проверяет подпись. Для реализации DNSSEC оператор зоны использует закрытый ZSK для создания цифровых подписей для каждого набора RRset и сохраняет их в виде записей RRSig на своем сервере имен.\n\nОднако только записи RRSig не могут использоваться преобразователями DNS для проверки подписей. Для этого оператор зоны добавляет общедоступный ZSK к своему серверу имен в записи DNSKEY.\n\nКогда преобразователь DNSSEC запрашивает тип записи, сервер имен возвращает соответствующий RRSig вместе с RRset. Затем преобразователь может получить общедоступный ZSK из записи DNSKEY на сервере имен. RRset, RRSig и общедоступный ZSK вместе могут проверить ответ.\n\nДоверие к ключу подписи зоны в записи DNSKEY также означает доверие ко всем записям в зоне. Но если ZSK скомпрометирован, крайне важно проверить общедоступный ZSK для обеспечения безопасности."
      ]
    },
    {
      "type": "picture",
      "width": "w60",
      "resource": "diagram-zone-signing-keys-2.svg"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>KSK – ключ для подписи ключей</b> – <b>используется для подписи или проверки ключей домена/зоны</b>. В дополнение к ключу подписи зоны серверы имен DNSSEC используют ключ подписи ключа (KSK). Подобно тому, как ZSK обеспечивал безопасность наборов RRset в предыдущем разделе, ключ KSK проверяет запись DNSKEY, подписывая общедоступный ZSK, тем самым создавая RRSIG для DNSKEY.\n\nОбщедоступный KSK также публикуется сервером имен в записи DNSKEY, как и общедоступный ZSK, что приводит к DNSKEY RRSet. И общедоступный KSK, и общедоступный ZSK подписываются привытным KSK. Это позволяет распознавателям использовать общедоступный KSK для проверки общедоступного ZSK."
      ]
    },
    "Валидация для резолвера теперь выглядит так:",
    {
      "type": "list-numeric",
      "items": [
        "Запросить нужный <b>RRSet</b>, который также возвращает соответствующую запись <b>RRSIG</b>.",
        "Запросить записи DNSKEY, содержащие <b>общедоступные ZSK и KSK</b>, которые также возвращают <b>RRSig</b> для <b>DNSKEY RRSet</b>.",
        "Проверить <b>RRSig</b> запрошенного <b>RRSet</b> с помощью <b>общедоступного ZSK</b>.",
        "Проверить <b>RRSig</b> в <b>DNSKEY RRSet</b> с помощью <b>общедоступного KSK</b>."
      ]
    },
    {
      "type": "picture",
      "width": "w60",
      "resource": "diagram-key-signing-keys-2.svg"
    },
    "Вы, наверное, уже заметили иерархическую природу DNS, и это только начало. Что касается KSK, DNSKEY RRSet и соответствующие записи RRSig можно кэшировать, чтобы избежать чрезмерных запросов к серверам имен DNS.",
    "Использование отдельных ключей подписи зоны и ключей подписи ключей направлено на облегчение замены старого или скомпрометированного KSK, как мы обсудим в следующем разделе. И наоборот, изменение ZSK — это более простой процесс, позволяющий использовать ZSK меньшего размера без ущерба для безопасности сервера и уменьшения объема данных, которые сервер должен передавать с каждым ответом.",
    "Хотя мы установили доверительные отношения в нашей зоне, DNS — это иерархическая система, и зоны обычно работают в сочетании друг с другом. Ключ подписи ключа подписывается сам по себе, что не добавляет дополнительного доверия, поэтому нам нужно средство для соединения доверия в нашей зоне с его родительской зоной.",
    {
      "type": "list-bullet",
      "items": [
        "<b>Запись DS — делегирование подписи</b> — <b>запись, содержащая хеш/дайджест общедоступного KSK дочернего домена/зоны (отпечаток общедоступного KSK дочернего)</b>. В DNSSEC введена запись лица, подписывающего делегирование (DS), для передачи доверия из родительской зоны в дочернюю зону. Для этого оператор зоны хеширует общедоступный KSK, содержащийся в записи DNSKEY, и предоставляет его родительской зоне для публикации в виде записи DS.\n\nВсякий раз, когда преобразователь направляется в дочернюю зону, родительская зона также предоставляет запись DS. Эта запись позволяет преобразователям определить, включена ли в дочерней зоне DNSSEC. Чтобы проверить общедоступный KSK зоны, преобразователь хеширует его и сравнивает с записью DS из родительской зоны. Если хэш-значения совпадают, распознаватель может с уверенностью предположить, что общедоступный KSK не был скомпрометирован или изменен, тем самым устанавливая доверие ко всем записям дочерней зоны. <b>Вот как в DNSSEC устанавливается цепочка доверия.</b>"
      ]
    },
    {
      "type": "picture",
      "width": "w50",
      "resource": "diagram-delegation-signer-records.svg"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>Цепочка доверия</b> — процесс установления доверия внутри зоны и привязки ее к родительской зоне требует наличия механизма проверки подлинности записи DS. Это достигается цифровой подписью записи DS, аналогично любому другому набору RRSet, в результате чего в родительской зоне существует соответствующий RRSig. Процесс проверки этой подписи повторяется последовательно, вплоть до общедоступного ключа KSK родительской зоны. Чтобы подтвердить подлинность этого KSK, необходимо проверить родительскую запись DS, продолжая этот процесс вверх по цепочке доверия."
      ]
    },
    {
      "type": "picture",
      "width": "w50",
      "resource": "diagram-the-chain-of-trust.svg"
    },
    {
      "type": "subtitle",
      "content": "Разрешения DNSSEC адресов"
    },
    "О, это было тяжело, не так ли? Ладно, хватит этой терминологии, все лучше видно на примерах. Мы собираемся изменить наш предыдущий поток разрешения DNS, чтобы включить DNSSEC.",
    {
      "type": "list-numeric",
      "items": [
        "Клиент отправляет рекурсивный запрос на свой локальный DNS-сервер рекурсивного кэширования для получения IP-адреса веб-страницы <b>\"cloudflare.com\"</b>.",
        "DNS-сервер с рекурсивным кэшированием отправляет итеративный запрос корневому (<b>\".\"</b>) серверу имен IP-адреса веб-страницы <b>\"cloudflare.com\"</b>.",
        "Корневой сервер имен:",
        [
          "Отправляет реферал:",
          {
            "style": "no-margin",
            "type": "list-bullet",
            "items": [
              "Незащищенная ссылка на авторитетный сервер имен TLD для зоны <b>\".com\"</b>."
            ]
          },
          "Отправляет запись:",
          {
            "style": "no-margin",
            "type": "list-bullet",
            "items": [
              "<b>RRSet записей DNSKEY</b> для корневой зоны — <b>общедоступный ZSK и общедоступный KSK</b> корневой зоны.",
              "<b>RRSig</b> вышеуказанного набора записей, подписанный с использованием <b>приватного ключа KSK</b> корневой зоны.",
              "<b>Запись DS</b> для зоны <b>\".com\"</b> — хэш/дайджест/отпечаток общедоступного ключа KSK зоны \".com\".",
              "<b>RRSig</b> вышеуказанной записи DS — подписано с использованием приватного ZSK корневой зоны."
            ]
          }
        ],
        "Рекурсивный кэширующий DNS-сервер:",
        [
          "Проверяет запись:",
          {
            "style": "no-margin",
            "type": "list-bullet",
            "items": [
              "<b>Набор RRSet DNSKEY</b> <b>корневой зоны</b> подтверждается успешной расшифровкой RRSig набора RRSet с использованием общедоступного ключа KSK корневой зоны.",
              "Запись DS <b>корневой</b> зоны для зоны <b>\".com\"</b> подтверждается успешной расшифровкой RRSig записи с использованием общедоступного ZSK <b>корневой</b> зоны."
            ]
          },
          "Проверяет зону:",
          {
            "style": "no-margin",
            "type": "list-bullet",
            "items": [
              "DNS-сервер с рекурсивным кэшированием уже имеет доверенную копию общедоступного корневого KSK, которую он получил с помощью средств, отличных от протокола DNS (например, от поставщика операционной системы сервера). Корневая зона проверяется DNS-сервером с рекурсивным кэшированием, когда обнаруживается, что серверная копия общедоступного корневого ключа KSK совпадает с копией, предоставленной серверу корневым DNS-сервером."
            ]
          }
        ],
        "DNS-сервер с рекурсивным кэшированием отправляет итеративный запрос серверу имен домена верхнего уровня <b>\".com\"</b> для <b>\"cloudflare.com\"</b>.",
        "Сервер имен TLD <b>\".com\"</b>:",
        [
          "Отправляет реферал:",
          {
            "style": "no-margin",
            "type": "list-bullet",
            "items": [
              "Незащищенный реферал для авторитетного сервера имен зоны <b>\"cloudflare\"</b>."
            ]
          },
          "Отправляет записи:",
          {
            "style": "no-margin",
            "type": "list-bullet",
            "items": [
              "<b>RRSet записей DNSKEY</b> для зоны \".com\" - <b>общедоступный ZSK и общедоступный KSK</b> зоны \".com\".",
              "<b>RRSig</b> вышеуказанного набора записей, подписанный с использованием <b>приватного ключа KSK</b> \".com\".",
              "<b>Запись DS</b> для зоны <b>\"cloudflare\"</b> — хэш/дайджест/отпечаток общедоступного ключа KSK зоны \"cloudflare\".",
              "<b>RRSig</b> вышеприведенной записи DS - подписано с использованием частного ZSK зоны \".com\"."
            ]
          }
        ],
        "Рекурсивный кэширующий DNS-сервер:",
        [
          "Проверяет записи:",
          {
            "style": "no-margin",
            "type": "list-bullet",
            "items": [
              "<b>\".com\" DNSKEY RRSet<b/b> подтверждается успешной расшифровкой RRSig RRSet с использованием общедоступного KSK зоны \".com\".",
              "Запись DS зоны <b>\".com\"</b> для зоны <b>\"cloudflare\"</b> подтверждается успешной расшифровкой RRSig записи с использованием общедоступного ZSK зоны <b>\".com\"</b>."
            ]
          },
          "Проверяет зону:",
          {
            "style": "no-margin",
            "type": "list-bullet",
            "items": [
              "Зона <b>\".com\"</b> проверяется путем сравнения хэша/дайджеста/отпечатка пальца общедоступного KSK зоны <b>\".com\"</b> с <b>\".com\"</ b> с ранее полученной DS-записью из корневой зоны для зоны <b>\".com\"</b>."
            ]
          }
        ],
        "DNS-сервер с рекурсивным кэшированием отправляет повторяющийся запрос авторитетному серверу имен \"cloudflare\" для \"cloudflare.com\".",
        "Авторитетный сервер имен \"cloudflare\":",
        [
          "Отправляет записи:",
          {
            "style": "no-margin",
            "type": "list-bullet",
            "items": [
              "<b>RRSet записей DNSKEY</b> для зоны <b>\"cloudflare\"</b> — общедоступный ключ ZSK и ключ KSK зоны <b>\"cloudflare\"</b>.",
              "<b>RRSig</b> вышеуказанного набора записей, подписанный с использованием закрытого ключа <b>\"cloudflare\"</b>.",
              "<b>RRSet из A записей</b> из зоны <b>\"cloudflare\"</b>.",
              "<b>RRSig</b> вышеуказанной записи DS — подписано с использованием частного ZSK зоны <b>\"cloudflare\"</b>."
            ]
          }
        ],
        "Рекурсивный кэширующий DNS-сервер:",
        [
          "Проверяет записи:",
          {
            "style": "no-margin",
            "type": "list-bullet",
            "items": [
              "<b>\"cloudflare\" DNSKEY RRSet</b> подтверждается успешной расшифровкой RRSig RRSet с использованием общедоступного KSK зоны <b>\"cloudflare\"</b>.",
              "<b>\"cloudflare\" RRSet</b> подтверждается успешной расшифровкой RRSig RRSet с использованием общедоступного ZSK зоны <b>\"cloudflare\"</b>."
            ]
          },
          "Проверяет зону:",
          {
            "style": "no-margin",
            "type": "list-bullet",
            "items": [
              "Зона <b>\"cloudflare\"</b> проверяется путем сравнения хэша/дайджеста/отпечатка пальца общедоступного KSK зоны <b>\"cloudflare\"</b> с зоной <b>\"cloudflare\"</b> с ранее полученной записью DS из корневой зоны для зоны <b>\"cloudflare\"</b>."
            ]
          }
        ],
        "DNS-сервер рекурсивного кэширования отвечает исходному клиенту с IP-адресом <b>\"cloudflare.com\"</b>.",
        "Клиент взаимодействует с веб-сервером <b>\"cloudflare.com\"</b>."
      ]
    },
    "Есть одна вещь, которую вам нужно понять. Все те примеры, которые представлены здесь о том, как работает DNS, являются академическими примерами. Это происходит только в стерильных, \"лабораторных\" условиях (в данном случае, если нигде не было схрона). Эти понятия достаточно легко понять, что они имеют место быть, в реальности же если и приходится настраивать такую систему, то это буквально несколько строк кода или изменение конфигурации.",
    "Такие примеры скорее понадобятся людям, проектирующим сети и инфраструктуры такого масштаба.",
    "Говоря о самом примере DNS, разные конфигурации представляют разные функции. Как упоминалось выше, все эти рекурсивные распознаватели, кеширующий сервер или корневые серверы имен — это просто роли, физически это может быть одна машина. Следовательно, конфигурация вашего DNS-сервера также зависит от того, что вы хотите построить. Поэтому будьте осторожны с рекомендациями, которые вы найдете в Интернете.",
    {
      "type": "title",
      "content": "Церемония подписания корневого каталога DNSSEC"
    },
    "О, на самом деле, чтобы понять, как все устроено, вам не нужно ничего знать об этой церемонии, но она выглядит так круто и звучит так пафосно, что я не мог не написать об этом. <b>Ключи к Интернету</b>, неплохо, да?",
    "Вы, наверное, уже обратили внимание на то, как эта иерархия DNS идет снизу вверх. В таком случае у вас может возникнуть логичный вопрос: что находится на самом верху?",
    "В этом заключается цель церемонии подписания корневого каталога — строгой процедуры подписания информации об открытых ключах корневой зоны DNS на следующие несколько месяцев. Закрытый ключ подписи, используемый в этом процессе, буквально является ключом ко всему Интернету, защищенному с помощью DNSSEC. Публичная, проверенная и строго контролируемая церемония доступа к этому ключу необходима для того, чтобы DNSSEC преуспела в качестве глобального стандарта.",
    "Просто найдите видео этой церемонии, потому что оно переведено в Интернете, и посмотрите, откуда берется доверие к DNSSEC.",
    {
      "type": "title",
      "content": "О шифровании DNS"
    },
    "Как вы уже выяснили, DNSSEC обеспечивает только аутентификацию, но все равно передает ее в открытом виде. Вот где в игру вступает криптография, наши любимые HTTPS и TLS, которые помогут нам обеспечить не только аутентификацию нашего трафика, но и его конфиденциальность.",
    {
      "type": "subtitle",
      "content": "DNS через TLS"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>DNS через TLS (или DoT)</b> — это стандарт шифрования DNS-запросов, обеспечивающий их безопасность и конфиденциальность. DoT использует тот же протокол, что и HTTPS, для шифрования и аутентификации соединения. Обычно DNS работает через UDP. Что делает DoT, так это добавляет шифрование TLS поверх протокола пользовательских дейтаграмм (UDP), который используется для DNS-запросов. Кроме того, это гарантирует, что DNS-запросы и ответы не будут подделаны или подделаны с помощью атак на пути."
      ]
    },
    {
      "type": "subtitle",
      "content": "DNS через HTTPS"
    },
    {
      "type": "list-bullet",
      "items": [
        "<b>DNS через HTTPS (или DoH)</b> — это альтернатива DoT. DNS-запросы и ответы шифруются, но отправляются через протоколы HTTP или HTTP/2, а не напрямую через UDP. Трафик DoH выглядит как другой трафик HTTPS — например. обычное взаимодействие пользователя с веб-сайтами и веб-приложениями — с точки зрения сетевого администратора."
      ]
    },
    "В феврале 2020 года браузер Mozilla Firefox начал по умолчанию включать DoH для пользователей из США. DNS-запросы из браузера Firefox шифруются DoH и отправляются либо в Cloudflare, либо в NextDNS. Некоторые другие браузеры также поддерживают DoH, хотя по умолчанию он не включен.",
    {
      "type": "subtitle",
      "content": "Разница между DoT и DoH"
    },
    "Основное различие между ними заключается в том, <b>какой порт они используют</b>. DoT использует только порт 853, в то время как DoH использует порт 443, который также используется для всего остального HTTPS-трафика.",
    "Поскольку у DoT есть выделенный порт, любой, у кого есть доступ к сети, может видеть входящий и исходящий трафик DoT, даже если сами запросы и ответы зашифрованы. Напротив, при DoH DNS-запросы и ответы маскируются внутри другого HTTPS-трафика, поскольку все они приходят и уходят с одного и того же порта.",
    "<b>С точки зрения сетевой безопасности DoT, возможно, лучше</b>. Это дает сетевому администратору возможность отслеживать и блокировать DNS-запросы, что важно для выявления и пресечения вредоносной активности.",
    "<b>Запросы DoH, тем временем, скрыты в обычном HTTPS-трафике</b>, а это означает, что их нельзя легко заблокировать без блокировки всего остального HTTPS-трафика. Однако с точки зрения конфиденциальности DoH, возможно, предпочтительнее. С DoH DNS-запросы скрыты в более крупном потоке HTTPS-трафика. Это дает сетевым администраторам меньшую видимость, но предоставляет пользователям большую конфиденциальность.",
    {
      "type": "title",
      "content": "Выводы"
    },
    "В заключение, DNS (система доменных имен) является фундаментальным компонентом Интернета, который используется для преобразования доменных имен в IP-адреса. Хотя DNS имеет решающее значение для подключения к Интернету и онлайн-сервисов, он также уязвим для целого ряда атак на основе DNS, включая отравление кеша и спуфинг DNS.",
    "Для решения этих проблем безопасности был разработан DNSSEC (расширения безопасности системы доменных имен) в качестве протокола безопасности, который добавляет уровень криптографической защиты в систему DNS. Используя цифровые подписи для проверки подлинности ответов DNS, DNSSEC помогает защититься от целого ряда атак, связанных с DNS, обеспечивая целостность и надежность системы DNS.",
    "Хотя внедрение DNSSEC идет медленно, оно становится все более важным, поскольку угроза атак на основе DNS продолжает расти. Организациям, использующим онлайн-сервисы, следует рассмотреть возможность внедрения DNSSEC для защиты своего присутствия в Интернете, повышения безопасности своей сети и снижения риска атак на основе DNS. Поскольку Интернет продолжает развиваться, DNS и DNSSEC останутся важными компонентами глобальной сети, гарантируя надежность и безопасность онлайн-сервисов на долгие годы.",
    {
      "type": "title",
      "content": "Контакты и рекомендации"
    }
  ],
  "references": [{
    "name": "Что такое DNS от Cloudflare",
    "link": "https://www.cloudflare.com/en-gb/learning/dns/what-is-dns/"
  }, {
    "name": "Что такое DNSSEC от Cloudflare (очевидно, не так ли?)",
    "link": "https://www.cloudflare.com/en-gb/dns/dnssec/how-dnssec-works/"
  }, {
    "name": "DNS через TLS vs DNS через HTTPS",
    "link": "https://www.cloudflare.com/en-gb/learning/dns/dns-over-tls/"
  }, {
    "name": "Отравление кэша DNS и спуфинг",
    "link": "https://www.cloudflare.com/en-gb/learning/dns/dns-cache-poisoning/"
  }, {
    "name": "Люди, которые держат ключи от Интернета",
    "link": "https://www.cloudflare.com/en-gb/dns/dnssec/root-signing-ceremony/"
  }, {
    "name": "Хорошо написанная статья ICANN о том, что такое DNSSEC и почему это важно",
    "link": "https://www.icann.org/resources/pages/dnssec-what-is-it-why-important-2019-03-05-en"
  }, {
    "name": "Действительно классное видео, объясняющее DNS и DNSSEC.",
    "link": "https://www.youtube.com/watch?v=_8M_vuFcdZU"
  }]
}
