{
  "home": {
    "title": "Домашняя",
    "name": "Михаил Богдашич",
    "workTitles": "Инженер-программист / Специалист по обеспечению безопасности",
    "interests": "Веб-разработка, WEB3, сетевые технологии, DevOps и кибербезопасность.",
    "interestingPosts": "Самые интересные посты"
  },
  "blog": {
    "title": "Блог",
    "description": "Здесь вы найдете тот набор знаний, которые я накопал за всю свою карьеру (или хотя бы ее часть). Лучший способ чему-то научиться — это начать учить других, верно? Хорошо, поэтому ты здесь! Я очень ценю, что вы интересуетесь этим, и надеюсь, что вы сможете найти здесь что-то интересное/полезное. Спасибо!",
    "description2": "А пока побудьте здесь и поищите кое-что интересное.",
    "alexandriaLibrary": "Моя собственная Александрийская библиотека"
  },
  "projects": {
    "title": "Проекты",
    "description": "То, как я созидаю",
    "description2": "Вот список проектов, которые были созданы мной. Там вы найдете документацию, исходный код, общую идею и/или мое вдохновение и реализацию."
  },
  "about": {
    "title": "О блоге",
    "thanks": "Cпасибо!",
    "appreciating": "Я очень ценю, что вы интересуетесь тем, что я делаю.",
    "reasonForReading": "Блог, который вы сейчас читаете, был создан, чтобы поделиться знаниями, которые я приобрел за всю свою профессиональную карьеру. Этот простой статичный блог для меня - мой дневник знаний. Здесь я записываю все, что мне удалось узнать и попробуй объяснить здесь заблудшим людям как можно проще. Я искренне считаю, что лучший способ научиться чему-либо - это начать учить других людей, делиться с ними своими знаниями. И у меня на это есть несколько причин:",
    "sharingKnowledge": {
      "personalGrowth": "<b>Личный рост</b> - обмен своими знаниями с другими поможет вам лучше понять и сформулировать свои собственные мысли и идеи, что может привести к личностному росту и развитию.",
      "relationships": "<b>Построение отношений</b> - обмен знаниями с другими может способствовать укреплению отношений, так как это показывает, что вы цените их мнение и готовы помочь им расти и учиться.",
      "influence": "<b>Увеличение влияния</b> - делясь своими знаниями и опытом с другими, вы можете зарекомендовать себя как идейный лидер в своей области и увеличить свое влияние и авторитет.",
      "problems": "<b>Улучшенное решение проблем</b> - когда вы делитесь знаниями с другими, вы можете получить новые взгляды и идеи, которые помогут вам решать проблемы и находить решения проблем более эффективно.",
      "career": "<b>Карьерный рост</b> - обмен своими знаниями может привести к новым возможностям и признанию, которые помогут вам продвинуться по карьерной лестнице.",
      "givingBack": "<b>Отдача</b> - поделившись своими знаниями, вы можете отблагодарить других и оказать положительное влияние на их жизнь."
    },
    "overall": "В целом, обмен знаниями с другими может иметь ряд личных, профессиональных и социальных преимуществ, что делает его ценным и полезным опытом. Кстати, если вам интересна более техническая часть этого блога, о его реализации, вы не найдете ее здесь, просто прочитайте файл README на <a href='https://github.com/bl4drnnr/personal-blog' class='inline-link roboto'>странице репозитория</a>.",
    "contactMe": "Как связаться со мной",
    "contactInfo": "В случае, если у вас есть какие-либо вопросы/предложения или любая другая причина, по которой вы должны связаться со мной, вы можете сделать это, используя следующие каналы. Не стесняйтесь, я всегда буду рад поболтать, так что вот:"
  },
  "error": {
    "title": "Не найдено",
    "mainMessage": "Не найдено :(",
    "secondMessage": "Что бы вы ни искали, этого здесь нет...",
    "redirectMessage": "А как насчет того, чтобы попытаться найти интересные вещи где-нибудь еще?"
  }
}
