{
  "home": {
    "title": "Домашняя",
    "name": "Михаил Богдашич",
    "workTitles": "Инженер-программист / Специалист по обеспечению безопасности",
    "interests": "Веб-разработка, WEB3, сетевые технологии, DevOps и кибербезопасность.",
    "interestingPosts": "Самые интересные посты 🔥 :"
  },
  "about": {
    "title": "О блоге",
    "thanks": "Cпасибо!",
    "appreciating": "Я очень ценю, что вы интересуетесь тем, что я делаю.",
    "reasonForReading": "Блог, который вы сейчас читаете, был создан, чтобы поделиться знаниями, которые я приобрел за всю свою профессиональную карьеру. Этот простой статичный блог для меня - мой дневник знаний. Здесь я записываю все, что мне удалось узнать и попробуй объяснить здесь заблудшим людям как можно проще.",
    "teachingOther": "Я искренне считаю, что лучший способ научиться чему-либо - это начать учить других людей, делиться с ними своими знаниями. И у меня на это есть несколько причин:",
    "personalGrowthTitle": "Личный рост:",
    "personalGrowthDescription": "Обмен своими знаниями с другими поможет вам лучше понять и сформулировать свои собственные мысли и идеи, что может привести к личностному росту и развитию.",
    "relationshipsTitle": "Построение отношений:",
    "relationshipsDescription": "Обмен знаниями с другими может способствовать укреплению отношений, так как это показывает, что вы цените их мнение и готовы помочь им расти и учиться.",
    "influenceTitle": "Увеличение влияния:",
    "influenceDescription": "Делясь своими знаниями и опытом с другими, вы можете зарекомендовать себя как идейный лидер в своей области и увеличить свое влияние и авторитет.",
    "problemsTitle": "Улучшенное решение проблем:",
    "problemsDescription": "Когда вы делитесь знаниями с другими, вы можете получить новые взгляды и идеи, которые помогут вам решать проблемы и находить решения проблем более эффективно.",
    "careerTitle": "Карьерный рост:",
    "careerDescription": "Обмен своими знаниями может привести к новым возможностям и признанию, которые помогут вам продвинуться по карьерной лестнице.",
    "givingBackTitle": "Отдача:",
    "givingBackDescription": "Поделившись своими знаниями, вы можете отблагодарить других и оказать положительное влияние на их жизнь.",
    "overall": "В целом, обмен знаниями с другими может иметь ряд личных, профессиональных и социальных преимуществ, что делает его ценным и полезным опытом.",
    "aboutMe": "Что-то обо мне?",
    "kidding": "Ой, как мило! Неее... Шучу!"
  }
}
