{
  "home": {
    "title": "Домашняя",
    "name": "Михаил Богдашич",
    "workTitles": "Инженер-программист / Специалист по обеспечению безопасности",
    "interests": "Веб-разработка, WEB3, сетевые технологии, DevOps и кибербезопасность.",
    "interestingPosts": "Самые интересные посты"
  },
  "blog": {
    "title": "Блог",
    "description": "Здесь вы найдете тот набор знаний, которые я накопал за всю свою карьеру. Теория и практика. Лучший способ чему-то научиться — это начать учить других, верно? Отлично, поэтому ты здесь!",
    "alexandriaLibrary": "Моя собственная Александрийская библиотека"
  },
  "projects": {
    "title": "Проекты",
    "description": "То, как я созидаю",
    "description2": "Вот список проектов, которые были созданы мной. Там вы найдете документацию, исходный код, общую идею и/или мое вдохновение и реализацию."
  },
  "about": {
    "title": "О блоге",
    "thanks": "Cпасибо!",
    "appreciating": "Я очень ценю, что вы интересуетесь тем, что я делаю.",
    "reasonForReading": "Блог, который вы сейчас читаете, был создан, чтобы поделиться знаниями, которые я приобрел за всю свою профессиональную карьеру. Этот простой статичный блог для меня - мой дневник знаний. Здесь я записываю все, что мне удалось узнать и попробуй объяснить здесь заблудшим людям как можно проще. Я искренне считаю, что лучший способ научиться чему-либо - это начать учить других людей, делиться с ними своими знаниями. И у меня на это есть несколько причин:",
    "sharingKnowledge": {
      "personalGrowth": "Личный рост - обмен своими знаниями с другими поможет вам лучше понять и сформулировать свои собственные мысли и идеи, что может привести к личностному росту и развитию.",
      "relationships": "Построение отношений - обмен знаниями с другими может способствовать укреплению отношений, так как это показывает, что вы цените их мнение и готовы помочь им расти и учиться.",
      "influence": "Увеличение влияния - делясь своими знаниями и опытом с другими, вы можете зарекомендовать себя как идейный лидер в своей области и увеличить свое влияние и авторитет.",
      "problems": "Улучшенное решение проблем - когда вы делитесь знаниями с другими, вы можете получить новые взгляды и идеи, которые помогут вам решать проблемы и находить решения проблем более эффективно.",
      "career": "Карьерный рост - обмен своими знаниями может привести к новым возможностям и признанию, которые помогут вам продвинуться по карьерной лестнице.",
      "givingBack": "Отдача - поделившись своими знаниями, вы можете отблагодарить других и оказать положительное влияние на их жизнь."
    },
    "whatDoIKnow": "Что я умею?",
    "whatIKnow": {
      "p0": "Как и подобает настоящему инженеру по кибербезопасности, мне нужно упомянуть все языки программирования и фреймворки, с которыми я когда-либо работал. Хоть я уже и не профессиональный программист и не думаю, что когда-нибудь вернусь на этот путь, он приносит мне массу удовольствия. Я даже скажу больше, я действительно начал получать от этого удовольствие, когда перестал делать это за деньги.",
      "p1": "В связи с тем, что моя профессиональная карьера началась как веб-разработчик полного стека, я начал и остановился на языках программирования, тесно связанных с этим. Честно говоря, меня никогда не привлекали низкоуровневые языки программирования, но то, как работает Интернет, мне всегда было интересно. Поэтому вот основные:",
      "p2": "Естественно, будучи веб-разработчиком, нет смысла перечислять языки программирования, так как все современные веб-приложения пишутся с использованием фреймворков. Я пробовал разные фреймворки как для фронта, так и для написания API, и вот самые важные из них:",
      "p3": "Чем больше я хотел стать инженером в сфере кибербезопасности, тем дальше мне приходилост отходить от всего того, что пусть даже частично но было связанно с программированием. Но я не был против, мне всегда нравилось узнавать что-то новое, поэтому я начал глубже изучать то, как работают операционные системы. И конечно же, начал строить свои собственные различные сервера, такие как веб сервера, DNS сервера, NTP севрера и так далее, и играться с ними:",
      "p4": "Чем больше я хотел стать инженером по кибербезопасности, тем дальше мне приходилось отдаляться от всего, что хоть отчасти было связано с программированием. Но я был не против, мне всегда нравилось узнавать что-то новое, поэтому я начал более глубоко изучать, как работают операционные системы:",
      "p5": "Ну, вот где я и что я знаю. Я искренне верю, что это стремление к знаниям продлится всю мою жизнь, но я солгу, если скажу, что такой расклад вещей меня не устраивает, всегда будет что-то, чему я должен научиться, и как сказал Сократ: \"Я знаю, что я ничего не знаю\". Итак, продолжайте погоню!"
    },
    "careerPath": {
      "title": "Мой карьерный путь",
      "careers": [{
        "image": "knowde.jpeg",
        "workingPeriod": "Сентябрь 2022 г. - настоящее время",
        "name": "Knowde",
        "description": [
          "В Knowde я начал свою карьеру в качестве инженера по безопасности.",
          "Хотя история была довольно интересной. Изначально вся служба безопасности была предоставлена третьей стороной (извините, но со своими обязанностями они справились просто ужасно). Затем в Knowde решили, что было бы неплохо иметь свою собственную команду внутренней безопасности, и я стал ее самым первым членом в качестве SecOps. Итак, нам пришлось убирать за предыдущей командой.",
          "В любом случае, я им очень благодарен за мой первый сертификат безопасности, который они смогли мне предоставить."
        ],
        "page": "https://knowde.com"
      }, {
        "image": "cv.jpeg",
        "workingPeriod": "Июнь 2021 - Сентябрь 2022 / 1 г. 4 мес.",
        "name": "Cryptovoucher",
        "description": [
          "Здесь все началось. Это был совсем небольшой польский стартап (во времена меня там было около 10 человек), узкоспециализированный на криптовалютах.",
          "В Cryptovoucher я получил свой первый опыт в качестве разработчика. В основном мы работали над двумя проектами: первый — cryptovoucher.io — рынок криптовалют, а второй — копия g2a.com, но с криптовалютами — simplebuy.io. К сожалению, последний закрылся... Грустная история...",
          "Затем был еще один проект - P100, это было финансово-банковское и криптомобильное приложение. Если вы когда-либо пользовались приложением Revolut или хотя бы знаете, что это такое, вы знаете, что такое P100.",
          "Для этого проекта мы изменили стек технологий на Next.js и Nest.js. ~4 мес."
        ],
        "page": "https://cryptovoucher.io"
      }]
    },
    "achievements": {
      "title": "Вещи, которыми я горжусь",
      "certs": [{
        "title": "CompTIA Security+",
        "link": "",
        "description": "Мой самый первый CompTI Security+ сертификат. Глядя на то, через что мне пришлось пройти тогда, я сейчас понимаю, что это была не такая уж и сложная задача, но тогда это так не казалось. Истекает 25 января 2026 года."
      }]
    },
    "overall": "В целом, обмен знаниями с другими может иметь ряд личных, профессиональных и социальных преимуществ, что делает его ценным и полезным опытом. Кстати, если вам интересна более техническая часть этого блога, о его реализации, вы не найдете ее здесь, просто прочитайте файл README на <a href='https://github.com/bl4drnnr/personal-blog' class='inline-link non-en'>странице репозитория</a>.",
    "contactMe": "Как связаться со мной",
    "contactInfo": "В случае, если у вас есть какие-либо вопросы/предложения или какая-либо другая причина, по которой вы должны связаться со мной, вы можете сделать это, используя следующие каналы, не стесняйтесь делать это. Я хотел бы услышать ваши мысли и идеи, поэтому не стесняйтесь обращаться к нам, и я всегда буду рад поболтать, так что, пожалуйста:"
  },
  "error": {
    "title": "Не найдено",
    "mainMessage": "Не найдено :(",
    "secondMessage": "Что бы вы ни искали, этого здесь нет...",
    "redirectMessage": "А как насчет того, чтобы попытаться найти интересные вещи где-нибудь еще?"
  }
}
