{
  "home": {
    "title": "Home",
    "name": "Mikhail Bahdashych",
    "workTitles": "Software Engineer / Security Operations Specialist",
    "interests": "Web Development, WEB3, Network Technologies, DevOps & Cybersecurity.",
    "interestingPosts": "Most interesting posts 🔥 :"
  },
  "blog": {
    "title": "Blog",
    "description": "Here you will find the collection of knowledge that has been grabbed by me for the entire my career (or at least part of it). The best way to learn something is to start teach others, right? Ok, here you are! Anyway, I really appreciate you are interested in that and hope that you will be able to find something interesting/useful here. Thank you!",
    "description2": "Meanwhile, hang around here and try to find some cool stuff.",
    "alexandriaLibrary": "My own Library of Alexandria"
  },
  "projects": {
    "title": "Projects",
    "description": "The way I create",
    "description2": "Here is the list of projects that have been created by me. There, you will find documentation, source code, general idea and/or my inspiration and implementation."
  },
  "about": {
    "title": "About",
    "thanks": "Thank you!",
    "appreciating": "I really appreciate you are interested in what I am doing.",
    "reasonForReading": "The blog you are reading at the moment was created to share the knowledge that I have acquired during my entire professional career. This simple static blog is my knowledge diary for me. Here I write down everything that I managed to learn and try to explain here to the misguided people in the simplest possible way.",
    "teachingOther": "I sincerely believe that the best way to learn anything is to start teaching other people, sharing your knowledge with them. And I have several reasons for this:",
    "personalGrowthTitle": "Personal Growth:",
    "personalGrowthDescription": "Sharing your knowledge with others helps you to better understand and articulate your own thoughts and ideas, which can lead to personal growth and development.",
    "relationshipsTitle": "Building Relationships:",
    "relationshipsDescription": "Sharing knowledge with others can foster strong relationships, as it shows that you value their opinions and are willing to help them grow and learn.",
    "influenceTitle": "Increased Influence:",
    "influenceDescription": "By sharing your knowledge and expertise with others, you can establish yourself as a thought leader in your field and increase your influence and credibility.",
    "problemsTitle": "Improved Problem-Solving:",
    "problemsDescription": "When you share knowledge with others, you can receive new perspectives and ideas that can help you tackle challenges and find solutions to problems more effectively.",
    "careerTitle": "Career Advancement:",
    "careerDescription": "Sharing your knowledge can lead to new opportunities and recognition, which can help you advance in your career.",
    "givingBackTitle": "Giving Back:",
    "givingBackDescription": "Sharing your knowledge can be a way of giving back to others and making a positive impact on their lives.",
    "overall": "Overall, sharing knowledge with others can have a number of personal, professional, and societal benefits, making it a valuable and rewarding experience.",
    "aboutMe": "Something about me?",
    "kidding": "Oh, how sweet! Nah... Just kidding!"
  },
  "error": {
    "title": "Not found",
    "mainMessage": "Not found :(",
    "secondMessage": "No matter what you were looking for, it is not here...",
    "redirectMessage": "What about to try to find cool stuff somewhere else?"
  }
}
