{
  "home": {
    "title": "Domowa",
    "name": "Mikhail Bahdashych",
    "workTitles": "Inżynier oprogramowania / Specjalista ds. operacji bezpieczeństwa",
    "interests": "Web development, WEB3, technologie sieciowe, DevOps & cyberbezpieczeństwo.",
    "interestingPosts": "Najciekawsze wpisy 🔥 :"
  },
  "blog": {
    "title": "Blog",
    "description": "Tutaj znajdziesz zbiór wiedzy, którą zbierałem przez całą moją karierę (lub przynajmniej jej część). Najlepszym sposobem na nauczenie się czegoś jest rozpoczęcie nauczania innych, prawda? Ok, tutaj jesteś! Naprawdę doceniam, że się tym interesujesz i mam nadzieję, że znajdziesz tu coś interesującego/przydatnego. Dziękuję!",
    "description2": "Tymczasem pokręć się tutaj i spróbuj znaleźć jakieś fajne rzeczy."
  },
  "projects": {
    "title": "Projekty",
    "description": "Sposób, w jaki tworzę",
    "description2": "Oto lista projektów, które zostały stworzone przeze mnie. Znajdziesz tam dokumentację, kod źródłowy, ogólny pomysł i/lub moje inspiracje i realizację."
  },
  "about": {
    "title": "O projekcie",
    "thanks": "Dziękuję!",
    "appreciating": "Naprawdę doceniam, że interesujesz się tym, co robię.",
    "reasonForReading": "Blog, który w tej chwili czytasz, został stworzony, aby dzielić się wiedzą, którą zdobyłem podczas całej mojej kariery zawodowej. Ten prosty, statyczny blog jest dla mnie moim pamiętnikiem wiedzy. Tutaj zapisuję wszystko, czego udało mi się nauczyć i postaraj się wyjaśnić tutaj wprowadzonym w błąd ludziom w najprostszy możliwy sposób.",
    "teachingOther": "Szczerze wierzę, że najlepszym sposobem na nauczenie się czegokolwiek jest rozpoczęcie nauczania innych ludzi, dzielenie się z nimi swoją wiedzą. Mam ku temu kilka powodów:",
    "personalGrowthTitle": "Rozwój osobisty:",
    "personalGrowthDescription": "Dzielenie się swoją wiedzą z innymi pomaga lepiej rozumieć i wyrażać własne myśli i pomysły, co może prowadzić do osobistego wzrostu i rozwoju.",
    "relationshipsTitle": "Budowanie relacji:",
    "relationshipsDescription": "Dzielenie się wiedzą z innymi może sprzyjać budowaniu silnych relacji, ponieważ pokazuje, że cenisz ich opinie i chcesz pomóc im się rozwijać i uczyć.",
    "influenceTitle": "Zwiększony wpływ:",
    "influenceDescription": "Dzieląc się swoją wiedzą i doświadczeniem z innymi, możesz stać się liderem w swojej dziedzinie i zwiększyć swój wpływ i wiarygodność.",
    "problemsTitle": "Ulepszone rozwiązywanie problemów:",
    "problemsDescription": "Dzieląc się wiedzą z innymi, możesz uzyskać nowe perspektywy i pomysły, które pomogą Ci skuteczniej stawiać czoła wyzwaniom i znajdować rozwiązania problemów.",
    "careerTitle": "Awans zawodowy:",
    "careerDescription": "Dzielenie się swoją wiedzą może prowadzić do nowych możliwości i uznania, co może pomóc w rozwoju kariery.",
    "givingBackTitle": "Oddawanie:",
    "givingBackDescription": "Dzielenie się swoją wiedzą może być sposobem na odwdzięczenie się innym i wywarcie pozytywnego wpływu na ich życie.",
    "overall": "Ogólnie rzecz biorąc, dzielenie się wiedzą z innymi może przynieść wiele osobistych, zawodowych i społecznych korzyści, czyniąc z tego cenne i satysfakcjonujące doświadczenie.",
    "aboutMe": "Coś o mnie?",
    "kidding": "O, jak miło! Spoko... Żartuję!"
  }
}
